ezois_ka/oooezoiskaobmen/src/Documents/ВыгрузкаРегламентированныхОтчетов/ВыгрузкаРегламентированныхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыгрузкаРегламентированныхОтчетов</name>
  <registerRecords>InformationRegister.АрхивДанныхРегламентированнойОтчетности</registerRecords>
  <attributes>
    <name>ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоНалоговомуОргану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Основная</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.РегламентированныйОтчет</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТекстаВыгрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выгрузки</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВерсииФорматовВыгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/РегламентированныйОтчет/РегламентированныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегламентированныйОтчет</name>
  <comment>Регламентированный отчет</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Вид</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетности</name>
    <comment>Вид отчетности</comment>
    <type>
      <types>EnumRef.ВидыОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбраннаяФорма</name>
    <comment>Выбранная форма</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтчета</name>
    <comment>Сохраненные данные отчета</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <comment>Дата подписи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоНастройкиСтраниц</name>
    <comment>Дерево со списком настроек страниц</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>Единица измерения</comment>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОтчета</name>
    <comment>Имя встроенной или имя файла внешней обработки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаПосредника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОтчета</name>
    <comment>Наименование регламентированного отчета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>Периодичность представления отчета</comment>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьЕдиницыИзмерения</name>
    <comment>Точность единицы измерения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>DefinedType.СправочникБанкиБРО</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/CommonForms/ВыборОтчетаПредыдущегоПериода/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем КонтекстЭДОСервер;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ВидОтправляемогоДокумента", ВидОтправляемогоДокумента);
	Параметры.Свойство("Источник", Источник);
	Параметры.Свойство("ИсточникОтчета", ИсточникОтчета);
	Параметры.Свойство("КонецПериода", КонецПериода);
	Параметры.Свойство("НачалоПериода", НачалоПериода);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ТекстВыгрузки", ТекстВыгрузки);
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидОтчета", ВидОтправляемогоДокумента);
	Список.Параметры.УстановитьЗначениеПараметра("ИсточникОтчета", ИсточникОтчета);
	Список.Параметры.УстановитьЗначениеПараметра("Конец", КонецПериода);
	Список.Параметры.УстановитьЗначениеПараметра("Начало", НачалоПериода);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	
	Попытка
		Запрос = Новый Запрос(Список.ТекстЗапроса);
		Запрос.УстановитьПараметр("ВидОтчета", ВидОтправляемогоДокумента);
		Запрос.УстановитьПараметр("ИсточникОтчета", ИсточникОтчета);
		Запрос.УстановитьПараметр("Конец", КонецПериода);
		Запрос.УстановитьПараметр("Начало", НачалоПериода);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 Тогда 
			Выборка.Следующий();
			Источник = Выборка.Ссылка;
			Если ТипЗнч(Источник) = Тип("СправочникСсылка.ЭлектронныеПредставленияРегламентированныхОтчетов") Тогда 
				СписокВыборНаСервере_ЭлектронноеПредставление(Источник);
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда 
				ЗаполнятьПриОткрытии = Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не удалось получить электронное представление отчета'"));
		ЗаполнятьПриОткрытии = Ложь;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗаполнятьПриОткрытии Тогда 
		СписокВыборНаКлиенте_РегОтчет(Источник);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(Элемент.ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
		СписокВыборНаКлиенте_РегОтчет(Элемент.ТекущиеДанные.Ссылка);
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.ЭлектронныеПредставленияРегламентированныхОтчетов") Тогда 
		СписокВыборНаСервере_ЭлектронноеПредставление(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить("ТекстВыгрузки", ТекстВыгрузки);
	ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить("Источник", Источник);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьИзФайла(Команда)
	Если Не Ждать РегламентированнаяОтчетностьКлиент.РезультатПодключенияРасширенияРаботыСФайламиАсинх() Тогда 
		Возврат;
	КонецЕсли;
	
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.Заголовок = НСтр("ru = 'Выберите файл выгрузки'");
	ДВФ.Фильтр = НСтр("ru = 'Файл приложения (*.xml)|*.xml'");
	ДВФ.МножественныйВыбор = Ложь;
	ВыбранныеФайлы = Ждать ДВФ.ВыбратьАсинх();
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() = 1 Тогда 
		ПотокДанных = Ждать ФайловыеПотоки.ОткрытьДляЧтенияАсинх(ВыбранныеФайлы[0]);
		Если ТипЗнч(ПотокДанных) = Тип("ФайловыйПоток") Тогда 
			ЧтениеДанных = Новый ЧтениеДанных(ПотокДанных);
			ТекстВыгрузки.Очистить();
			#Если ВебКлиент Тогда
			// в вебклиенте ЧтениеДанных.ЧтениеЗавершено работает некорректно в 8.3.21
			Пока Истина Цикл 
				ТекСтр = Ждать ЧтениеДанных.ПрочитатьСтрокуАсинх();
				Если ЗначениеЗаполнено(ТекСтр) Тогда 
					ТекстВыгрузки.ДобавитьСтроку(ТекСтр);
				Иначе 
					Прервать;
				КонецЕсли;
			КонецЦикла;
			#Иначе
			Пока Не ЧтениеДанных.ЧтениеЗавершено Цикл 
				ТекстВыгрузки.ДобавитьСтроку(Ждать ЧтениеДанных.ПрочитатьСтрокуАсинх());
			КонецЦикла;
			#КонецЕсли
			Ждать ЧтениеДанных.ЗакрытьАсинх();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СписокВыборНаСервере_ЭлектронноеПредставление(Ссылка)
	Попытка
		КонтекстЭДОСервер = КонтекстЭДОСервер(); 
		ИзвлеченныеФайлы = КонтекстЭДОСервер.ИзвлечьЭлектронныеПредставленияВХранилище(Ссылка, УникальныйИдентификатор);
		
		ОбъектовВАрхиве = 0;
		Если ИзвлеченныеФайлы <> Неопределено Тогда
			Для Каждого СвойстваФайла Из ИзвлеченныеФайлы Цикл
				Если СвойстваФайла.ВАрхиве Тогда 
					ОбъектовВАрхиве = ОбъектовВАрхиве + 1;
				КонецЕсли;
				ОпределитьНовыйФайлВТаблицеСвойствФайлов(СвойстваФайла.ИмяФайла, СвойстваФайла.ТипФайлаОтчетности, СвойстваФайла.Данные, СвойстваФайла.ВАрхиве);
			КонецЦикла;
		КонецЕсли;
		
		Если СвойстваФайлов.Количество() = 1 Тогда
			ОсновнойФайл = СвойстваФайлов[0];
		Иначе
			ОсновнойФайл = ПолучитьОсновнойФайл();
		КонецЕсли;
		
		ДанныеФайла = ПолучитьИзВременногоХранилища(ОсновнойФайл.АдресДанных);
		ФайлОсновногоПредставления = ПолучитьИмяВременногоФайла("xml");
		ДанныеФайла.Записать(ФайлОсновногоПредставления);
		АдресДанныхФайлаОсновногоПредставления = ОсновнойФайл.АдресДанных;
		ПредставлениеТекст = КонтекстЭДОСервер.ПрочитатьТекстИзФайла(ФайлОсновногоПредставления, ,Истина);
		УдалитьФайлы(ФайлОсновногоПредставления);
		
		ТекстВыгрузки.УстановитьТекст(ПредставлениеТекст);
		Источник = Ссылка;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не удалось получить электронное представление отчета'"));
		ТекстВыгрузки.УстановитьТекст("");
		Источник = Справочники.ЭлектронныеПредставленияРегламентированныхОтчетов.ПустаяСсылка();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборНаКлиенте_РегОтчет(Ссылка)
	Попытка
		ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента");
		СпДокОсн = Новый СписокЗначений;
		СпДокОсн.Добавить(Ссылка);
		ПредставлениеТекст = "";
		ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн, ПредставлениеТекст);
		ТекстВыгрузки.УстановитьТекст(ПредставлениеТекст);
		Источник = Ссылка;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось получить электронное представление отчета'"));
		ТекстВыгрузки.УстановитьТекст("");
		Источник = ПредопределенноеЗначение("Документ.РегламентированныйОтчет.ПустаяСсылка");
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция КонтекстЭДОСервер()
	Если КонтекстЭДОСервер = Неопределено Тогда
		КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	КонецЕсли;
	
	Возврат КонтекстЭДОСервер;
КонецФункции

&НаСервере
Процедура ОпределитьНовыйФайлВТаблицеСвойствФайлов(ИмяФайла, ТипФайла, АдресДанных, Знач ВАрхиве = Ложь)
	НовСтр = СвойстваФайлов.Добавить();
	НовСтр.ИмяФайла = ИмяФайла;
	НовСтр.ТипФайлаОтчетности = ТипФайла;
	НовСтр.АдресДанных = АдресДанных;
	НовСтр.ВАрхиве = ВАрхиве;
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнойФайл()
	ОсновнойФайл = Неопределено;
	Для Каждого Стр Из СвойстваФайлов Цикл
		нрегРасширениеФайла = нрег(РасширениеФайла(стр.ИмяФайла));
		Если нрегРасширениеФайла = "xml" Тогда
			ОсновнойФайл = Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОсновнойФайл;
КонецФункции

&НаСервере
Функция РасширениеФайла(стрИмяФайла)
	СтрДлинаИмяФайла = СтрДлина(стрИмяФайла);
	Для Инд = 1 По СтрДлинаИмяФайла Цикл
		ТекущийИндекс = СтрДлинаИмяФайла - Инд + 1;
		Если Сред(стрИмяФайла, ТекущийИндекс, 1) = "." Тогда
			Возврат Сред(стрИмяФайла, ТекущийИндекс + 1);
		КонецЕсли;
	КонецЦикла;
	Возврат "";
КонецФункции

#КонецОбласти
